//
//  PostData.swift
//  genshin images
//
//  Created by Кирилл Паничкин on 4/8/26.
//

import SwiftUI

let posts: [Post] = [
    Post(
        title: "Эскофье",
        description: "Известный бывший шеф-повар «Дебор Отеля» в Фонтейне, удостоенный звания «главный кондитер», и первооткрывательница концепции «технологичной кулинарии», предъявляет невероятно высокие требования к процессу приготовления пищи.",
        image: Image("escoffier")
    ),
    Post(
        title: "Коломбина",
        description: "Дева Луны, рождённая в Нод-Крае, она же небесная луна, что вернулась домой.",
        image: Image("colombina")
    ),
    Post(
        title: "Цзы Бай",
        description: "В легендах Ли Юэ встречаются упоминания о Белой Лошади по имени Цзы Бай - самом загадочном из всех Адептов Ли Юэ.",
        image: Image("zibai")
    ),
    Post(
        title: "Флинс",
        description: "Светоносец Нод-Края, который присматривает за маяком и кладбищем на северном острове. Таинственный джентльмен с безупречными манерами.",
        image: Image("flins")
    ),
    Post(
        title: "Нёвиллет",
        description: "Верховный судья Фонтейна, или же юдекс, прославился своей безукоризненной беспристрастностью",
        image: Image("neuvillette")
    ),
    Post(
        title: "Арлекино",
        description: "Слуга, четвёртая из Предвестников Фатуи. Опытный, безжалостный дипломат. «Отец», которого боятся и на которого полагаются дети Дома очага.",
        image: Image("arlecchino")
    ),
]
